Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.65/include/proc/p32mz2064dah169.h
extern volatile __CEVERbits_t CEVERbits __asm__ ("CEVER") __attribute__((section("sfrs"), address(0xBF8E5000)));
#define CECON CECON
extern volatile uint32_t   CECON __attribute__((section("sfrs"), address(0xBF8E5004)));
typedef struct {
  uint32_t DMAEN:1;
  uint32_t BDPPLEN:1;
  uint32_t BDPCHST:1;
  uint32_t :2;
  uint32_t SWAPEN:1;
  uint32_t SWRST:1;
  uint32_t SWAPOEN:1;
} __CECONbits_t;
extern volatile __CECONbits_t CECONbits __asm__ ("CECON") __attribute__((section("sfrs"), address(0xBF8E5004)));
#define CEBDADDR CEBDADDR
extern volatile uint32_t   CEBDADDR __attribute__((section("sfrs"), address(0xBF8E5008)));
typedef struct {
  uint32_t BDPADDR:32;
} __CEBDADDRbits_t;
extern volatile __CEBDADDRbits_t CEBDADDRbits __asm__ ("CEBDADDR") __attribute__((section("sfrs"), address(0xBF8E5008)));
#define CEBDPADDR CEBDPADDR
extern volatile uint32_t   CEBDPADDR __attribute__((section("sfrs"), address(0xBF8E500C)));
typedef struct {
  uint32_t BASEADDR:32;
} __CEBDPADDRbits_t;
extern volatile __CEBDPADDRbits_t CEBDPADDRbits __asm__ ("CEBDPADDR") __attribute__((section("sfrs"), address(0xBF8E500C)));
#define CESTAT CESTAT
extern volatile uint32_t   CESTAT __attribute__((section("sfrs"), address(0xBF8E5010)));
typedef struct {
  uint32_t BDCTRL:16;
  uint32_t ACTIVE:1;
  uint32_t START:1;
  uint32_t BDSTATE:4;
  uint32_t :2;
  uint32_t ERRPHASE:2;
  uint32_t ERROP:3;
  uint32_t ERRMODE:3;
} __CESTATbits_t;
extern volatile __CESTATbits_t CESTATbits __asm__ ("CESTAT") __attribute__((section("sfrs"), address(0xBF8E5010)));
#define CEINTSRC CEINTSRC
extern volatile uint32_t   CEINTSRC __attribute__((section("sfrs"), address(0xBF8E5014)));
typedef struct {
  uint32_t PENDIF:1;
  uint32_t CBDIF:1;
  uint32_t PKTIF:1;
  uint32_t AREIF:1;
} __CEINTSRCbits_t;
extern volatile __CEINTSRCbits_t CEINTSRCbits __asm__ ("CEINTSRC") __attribute__((section("sfrs"), address(0xBF8E5014)));
#define CEINTEN CEINTEN
extern volatile uint32_t   CEINTEN __attribute__((section("sfrs"), address(0xBF8E5018)));
typedef struct {
  uint32_t PENDIE:1;
  uint32_t CBDIE:1;
  uint32_t PKTIE:1;
  uint32_t AREIE:1;
} __CEINTENbits_t;
extern volatile __CEINTENbits_t CEINTENbits __asm__ ("CEINTEN") __attribute__((section("sfrs"), address(0xBF8E5018)));
#define CEPOLLCON CEPOLLCON
extern volatile uint32_t   CEPOLLCON __attribute__((section("sfrs"), address(0xBF8E501C)));
typedef struct {
  uint32_t BDPPLCON:16;
} __CEPOLLCONbits_t;
extern volatile __CEPOLLCONbits_t CEPOLLCONbits __asm__ ("CEPOLLCON") __attribute__((section("sfrs"), address(0xBF8E501C)));
#define CEHDLEN CEHDLEN
extern volatile uint32_t   CEHDLEN __attribute__((section("sfrs"), address(0xBF8E5020)));
typedef struct {
  uint32_t HDRLEN:8;
} __CEHDLENbits_t;
extern volatile __CEHDLENbits_t CEHDLENbits __asm__ ("CEHDLEN") __attribute__((section("sfrs"), address(0xBF8E5020)));
#define CETRLLEN CETRLLEN
extern volatile uint32_t   CETRLLEN __attribute__((section("sfrs"), address(0xBF8E5024)));
typedef struct {
  uint32_t TRLRLEN:8;
} __CETRLLENbits_t;
extern volatile __CETRLLENbits_t CETRLLENbits __asm__ ("CETRLLEN") __attribute__((section("sfrs"), address(0xBF8E5024)));
#define RNGVER RNGVER
extern volatile uint32_t   RNGVER __attribute__((section("sfrs"), address(0xBF8E6000)));
typedef struct {
  uint32_t REVISION:7;
  uint32_t VERSION:9;
  uint32_t ID:16;
} __RNGVERbits_t;
extern volatile __RNGVERbits_t RNGVERbits __asm__ ("RNGVER") __attribute__((section("sfrs"), address(0xBF8E6000)));
#define RNGCON RNGCON
extern volatile uint32_t   RNGCON __attribute__((section("sfrs"), address(0xBF8E6004)));
typedef struct {
  uint32_t PLEN:8;
  uint32_t TRNGEN:1;
  uint32_t PRNGEN:1;
  uint32_t CONT:1;
  uint32_t TRNGMODE:1;
  uint32_t LOAD:1;
} __RNGCONbits_t;
extern volatile __RNGCONbits_t RNGCONbits __asm__ ("RNGCON") __attribute__((section("sfrs"), address(0xBF8E6004)));
#define RNGPOLY1 RNGPOLY1
extern volatile uint32_t   RNGPOLY1 __attribute__((section("sfrs"), address(0xBF8E6008)));
typedef struct {
  uint32_t POLY:32;
} __RNGPOLY1bits_t;
extern volatile __RNGPOLY1bits_t RNGPOLY1bits __asm__ ("RNGPOLY1") __attribute__((section("sfrs"), address(0xBF8E6008)));
#define RNGPOLY2 RNGPOLY2
extern volatile uint32_t   RNGPOLY2 __attribute__((section("sfrs"), address(0xBF8E600C)));
typedef struct {
  uint32_t POLY:32;
} __RNGPOLY2bits_t;
extern volatile __RNGPOLY2bits_t RNGPOLY2bits __asm__ ("RNGPOLY2") __attribute__((section("sfrs"), address(0xBF8E600C)));
#define RNGNUMGEN1 RNGNUMGEN1
extern volatile uint32_t   RNGNUMGEN1 __attribute__((section("sfrs"), address(0xBF8E6010)));
typedef struct {
  uint32_t RNG:32;
} __RNGNUMGEN1bits_t;
extern volatile __RNGNUMGEN1bits_t RNGNUMGEN1bits __asm__ ("RNGNUMGEN1") __attribute__((section("sfrs"), address(0xBF8E6010)));
#define RNGNUMGEN2 RNGNUMGEN2
extern volatile uint32_t   RNGNUMGEN2 __attribute__((section("sfrs"), address(0xBF8E6014)));
typedef struct {
  uint32_t RNG:32;
} __RNGNUMGEN2bits_t;
extern volatile __RNGNUMGEN2bits_t RNGNUMGEN2bits __asm__ ("RNGNUMGEN2") __attribute__((section("sfrs"), address(0xBF8E6014)));
#define RNGSEED1 RNGSEED1
extern volatile uint32_t   RNGSEED1 __attribute__((section("sfrs"), address(0xBF8E6018)));
typedef struct {
  uint32_t SEED:32;
} __RNGSEED1bits_t;
extern volatile __RNGSEED1bits_t RNGSEED1bits __asm__ ("RNGSEED1") __attribute__((section("sfrs"), address(0xBF8E6018)));
#define RNGSEED2 RNGSEED2
extern volatile uint32_t   RNGSEED2 __attribute__((section("sfrs"), address(0xBF8E601C)));
typedef struct {
  uint32_t SEED:32;
} __RNGSEED2bits_t;
extern volatile __RNGSEED2bits_t RNGSEED2bits __asm__ ("RNGSEED2") __attribute__((section("sfrs"), address(0xBF8E601C)));
#define RNGCNT RNGCNT
extern volatile uint32_t   RNGCNT __attribute__((section("sfrs"), address(0xBF8E6020)));
typedef struct {
  uint32_t RCNT:7;
} __RNGCNTbits_t;
extern volatile __RNGCNTbits_t RNGCNTbits __asm__ ("RNGCNT") __attribute__((section("sfrs"), address(0xBF8E6020)));
#define DDRTSEL DDRTSEL
extern volatile uint32_t   DDRTSEL __attribute__((section("sfrs"), address(0xBF8E8000)));
typedef struct {
  uint32_t TSEL:8;
} __DDRTSELbits_t;
extern volatile __DDRTSELbits_t DDRTSELbits __asm__ ("DDRTSEL") __attribute__((section("sfrs"), address(0xBF8E8000)));
#define DDRMINLIM DDRMINLIM
extern volatile uint32_t   DDRMINLIM __attribute__((section("sfrs"), address(0xBF8E8004)));
typedef struct {
  uint32_t MINLIMIT:5;
} __DDRMINLIMbits_t;
