Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.65/include/proc/p32mz2064dah169.h
#define _GLCDCLUT231_RED_POSITION                0x00000010
#define _GLCDCLUT231_RED_MASK                    0x00FF0000
#define _GLCDCLUT231_RED_LENGTH                  0x00000008

#define _GLCDCLUT232_BLUE_POSITION               0x00000000
#define _GLCDCLUT232_BLUE_MASK                   0x000000FF
#define _GLCDCLUT232_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT232_GREEN_POSITION              0x00000008
#define _GLCDCLUT232_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT232_GREEN_LENGTH                0x00000008

#define _GLCDCLUT232_RED_POSITION                0x00000010
#define _GLCDCLUT232_RED_MASK                    0x00FF0000
#define _GLCDCLUT232_RED_LENGTH                  0x00000008

#define _GLCDCLUT233_BLUE_POSITION               0x00000000
#define _GLCDCLUT233_BLUE_MASK                   0x000000FF
#define _GLCDCLUT233_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT233_GREEN_POSITION              0x00000008
#define _GLCDCLUT233_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT233_GREEN_LENGTH                0x00000008

#define _GLCDCLUT233_RED_POSITION                0x00000010
#define _GLCDCLUT233_RED_MASK                    0x00FF0000
#define _GLCDCLUT233_RED_LENGTH                  0x00000008

#define _GLCDCLUT234_BLUE_POSITION               0x00000000
#define _GLCDCLUT234_BLUE_MASK                   0x000000FF
#define _GLCDCLUT234_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT234_GREEN_POSITION              0x00000008
#define _GLCDCLUT234_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT234_GREEN_LENGTH                0x00000008

#define _GLCDCLUT234_RED_POSITION                0x00000010
#define _GLCDCLUT234_RED_MASK                    0x00FF0000
#define _GLCDCLUT234_RED_LENGTH                  0x00000008

#define _GLCDCLUT235_BLUE_POSITION               0x00000000
#define _GLCDCLUT235_BLUE_MASK                   0x000000FF
#define _GLCDCLUT235_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT235_GREEN_POSITION              0x00000008
#define _GLCDCLUT235_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT235_GREEN_LENGTH                0x00000008

#define _GLCDCLUT235_RED_POSITION                0x00000010
#define _GLCDCLUT235_RED_MASK                    0x00FF0000
#define _GLCDCLUT235_RED_LENGTH                  0x00000008

#define _GLCDCLUT236_BLUE_POSITION               0x00000000
#define _GLCDCLUT236_BLUE_MASK                   0x000000FF
#define _GLCDCLUT236_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT236_GREEN_POSITION              0x00000008
#define _GLCDCLUT236_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT236_GREEN_LENGTH                0x00000008

#define _GLCDCLUT236_RED_POSITION                0x00000010
#define _GLCDCLUT236_RED_MASK                    0x00FF0000
#define _GLCDCLUT236_RED_LENGTH                  0x00000008

#define _GLCDCLUT237_BLUE_POSITION               0x00000000
#define _GLCDCLUT237_BLUE_MASK                   0x000000FF
#define _GLCDCLUT237_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT237_GREEN_POSITION              0x00000008
#define _GLCDCLUT237_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT237_GREEN_LENGTH                0x00000008

#define _GLCDCLUT237_RED_POSITION                0x00000010
#define _GLCDCLUT237_RED_MASK                    0x00FF0000
#define _GLCDCLUT237_RED_LENGTH                  0x00000008

#define _GLCDCLUT238_BLUE_POSITION               0x00000000
#define _GLCDCLUT238_BLUE_MASK                   0x000000FF
#define _GLCDCLUT238_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT238_GREEN_POSITION              0x00000008
#define _GLCDCLUT238_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT238_GREEN_LENGTH                0x00000008

#define _GLCDCLUT238_RED_POSITION                0x00000010
#define _GLCDCLUT238_RED_MASK                    0x00FF0000
#define _GLCDCLUT238_RED_LENGTH                  0x00000008

#define _GLCDCLUT239_BLUE_POSITION               0x00000000
#define _GLCDCLUT239_BLUE_MASK                   0x000000FF
#define _GLCDCLUT239_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT239_GREEN_POSITION              0x00000008
#define _GLCDCLUT239_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT239_GREEN_LENGTH                0x00000008

#define _GLCDCLUT239_RED_POSITION                0x00000010
#define _GLCDCLUT239_RED_MASK                    0x00FF0000
#define _GLCDCLUT239_RED_LENGTH                  0x00000008

#define _GLCDCLUT240_BLUE_POSITION               0x00000000
#define _GLCDCLUT240_BLUE_MASK                   0x000000FF
#define _GLCDCLUT240_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT240_GREEN_POSITION              0x00000008
#define _GLCDCLUT240_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT240_GREEN_LENGTH                0x00000008

#define _GLCDCLUT240_RED_POSITION                0x00000010
#define _GLCDCLUT240_RED_MASK                    0x00FF0000
#define _GLCDCLUT240_RED_LENGTH                  0x00000008

#define _GLCDCLUT241_BLUE_POSITION               0x00000000
#define _GLCDCLUT241_BLUE_MASK                   0x000000FF
#define _GLCDCLUT241_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT241_GREEN_POSITION              0x00000008
#define _GLCDCLUT241_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT241_GREEN_LENGTH                0x00000008

#define _GLCDCLUT241_RED_POSITION                0x00000010
#define _GLCDCLUT241_RED_MASK                    0x00FF0000
#define _GLCDCLUT241_RED_LENGTH                  0x00000008

#define _GLCDCLUT242_BLUE_POSITION               0x00000000
#define _GLCDCLUT242_BLUE_MASK                   0x000000FF
#define _GLCDCLUT242_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT242_GREEN_POSITION              0x00000008
#define _GLCDCLUT242_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT242_GREEN_LENGTH                0x00000008

#define _GLCDCLUT242_RED_POSITION                0x00000010
#define _GLCDCLUT242_RED_MASK                    0x00FF0000
#define _GLCDCLUT242_RED_LENGTH                  0x00000008

#define _GLCDCLUT243_BLUE_POSITION               0x00000000
#define _GLCDCLUT243_BLUE_MASK                   0x000000FF
#define _GLCDCLUT243_BLUE_LENGTH                 0x00000008

