Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.65/include/proc/p32mz2064dah169.h
#define _GLCDCURDATA8_PIXEL24_POSITION           0x0000000C
#define _GLCDCURDATA8_PIXEL24_MASK               0x0000F000
#define _GLCDCURDATA8_PIXEL24_LENGTH             0x00000004

#define _GLCDCURDATA8_PIXEL23_POSITION           0x00000010
#define _GLCDCURDATA8_PIXEL23_MASK               0x000F0000
#define _GLCDCURDATA8_PIXEL23_LENGTH             0x00000004

#define _GLCDCURDATA8_PIXEL22_POSITION           0x00000014
#define _GLCDCURDATA8_PIXEL22_MASK               0x00F00000
#define _GLCDCURDATA8_PIXEL22_LENGTH             0x00000004

#define _GLCDCURDATA8_PIXEL21_POSITION           0x00000018
#define _GLCDCURDATA8_PIXEL21_MASK               0x0F000000
#define _GLCDCURDATA8_PIXEL21_LENGTH             0x00000004

#define _GLCDCURDATA8_PIXEL20_POSITION           0x0000001C
#define _GLCDCURDATA8_PIXEL20_MASK               0xF0000000
#define _GLCDCURDATA8_PIXEL20_LENGTH             0x00000004

#define _GLCDCURDATA9_PIXEL215_POSITION          0x00000000
#define _GLCDCURDATA9_PIXEL215_MASK              0x0000000F
#define _GLCDCURDATA9_PIXEL215_LENGTH            0x00000004

#define _GLCDCURDATA9_PIXEL214_POSITION          0x00000004
#define _GLCDCURDATA9_PIXEL214_MASK              0x000000F0
#define _GLCDCURDATA9_PIXEL214_LENGTH            0x00000004

#define _GLCDCURDATA9_PIXEL213_POSITION          0x00000008
#define _GLCDCURDATA9_PIXEL213_MASK              0x00000F00
#define _GLCDCURDATA9_PIXEL213_LENGTH            0x00000004

#define _GLCDCURDATA9_PIXEL212_POSITION          0x0000000C
#define _GLCDCURDATA9_PIXEL212_MASK              0x0000F000
#define _GLCDCURDATA9_PIXEL212_LENGTH            0x00000004

#define _GLCDCURDATA9_PIXEL211_POSITION          0x00000010
#define _GLCDCURDATA9_PIXEL211_MASK              0x000F0000
#define _GLCDCURDATA9_PIXEL211_LENGTH            0x00000004

#define _GLCDCURDATA9_PIXEL210_POSITION          0x00000014
#define _GLCDCURDATA9_PIXEL210_MASK              0x00F00000
#define _GLCDCURDATA9_PIXEL210_LENGTH            0x00000004

#define _GLCDCURDATA9_PIXEL29_POSITION           0x00000018
#define _GLCDCURDATA9_PIXEL29_MASK               0x0F000000
#define _GLCDCURDATA9_PIXEL29_LENGTH             0x00000004

#define _GLCDCURDATA9_PIXEL28_POSITION           0x0000001C
#define _GLCDCURDATA9_PIXEL28_MASK               0xF0000000
#define _GLCDCURDATA9_PIXEL28_LENGTH             0x00000004

#define _GLCDCURDATA10_PIXEL223_POSITION         0x00000000
#define _GLCDCURDATA10_PIXEL223_MASK             0x0000000F
#define _GLCDCURDATA10_PIXEL223_LENGTH           0x00000004

#define _GLCDCURDATA10_PIXEL222_POSITION         0x00000004
#define _GLCDCURDATA10_PIXEL222_MASK             0x000000F0
#define _GLCDCURDATA10_PIXEL222_LENGTH           0x00000004

#define _GLCDCURDATA10_PIXEL221_POSITION         0x00000008
#define _GLCDCURDATA10_PIXEL221_MASK             0x00000F00
#define _GLCDCURDATA10_PIXEL221_LENGTH           0x00000004

#define _GLCDCURDATA10_PIXEL220_POSITION         0x0000000C
#define _GLCDCURDATA10_PIXEL220_MASK             0x0000F000
#define _GLCDCURDATA10_PIXEL220_LENGTH           0x00000004

#define _GLCDCURDATA10_PIXEL219_POSITION         0x00000010
#define _GLCDCURDATA10_PIXEL219_MASK             0x000F0000
#define _GLCDCURDATA10_PIXEL219_LENGTH           0x00000004

#define _GLCDCURDATA10_PIXEL218_POSITION         0x00000014
#define _GLCDCURDATA10_PIXEL218_MASK             0x00F00000
#define _GLCDCURDATA10_PIXEL218_LENGTH           0x00000004

#define _GLCDCURDATA10_PIXEL217_POSITION         0x00000018
#define _GLCDCURDATA10_PIXEL217_MASK             0x0F000000
#define _GLCDCURDATA10_PIXEL217_LENGTH           0x00000004

#define _GLCDCURDATA10_PIXEL216_POSITION         0x0000001C
#define _GLCDCURDATA10_PIXEL216_MASK             0xF0000000
#define _GLCDCURDATA10_PIXEL216_LENGTH           0x00000004

#define _GLCDCURDATA11_PIXEL231_POSITION         0x00000000
#define _GLCDCURDATA11_PIXEL231_MASK             0x0000000F
#define _GLCDCURDATA11_PIXEL231_LENGTH           0x00000004

#define _GLCDCURDATA11_PIXEL230_POSITION         0x00000004
#define _GLCDCURDATA11_PIXEL230_MASK             0x000000F0
#define _GLCDCURDATA11_PIXEL230_LENGTH           0x00000004

#define _GLCDCURDATA11_PIXEL229_POSITION         0x00000008
#define _GLCDCURDATA11_PIXEL229_MASK             0x00000F00
#define _GLCDCURDATA11_PIXEL229_LENGTH           0x00000004

#define _GLCDCURDATA11_PIXEL228_POSITION         0x0000000C
#define _GLCDCURDATA11_PIXEL228_MASK             0x0000F000
#define _GLCDCURDATA11_PIXEL228_LENGTH           0x00000004

#define _GLCDCURDATA11_PIXEL227_POSITION         0x00000010
#define _GLCDCURDATA11_PIXEL227_MASK             0x000F0000
#define _GLCDCURDATA11_PIXEL227_LENGTH           0x00000004

#define _GLCDCURDATA11_PIXEL226_POSITION         0x00000014
#define _GLCDCURDATA11_PIXEL226_MASK             0x00F00000
#define _GLCDCURDATA11_PIXEL226_LENGTH           0x00000004

#define _GLCDCURDATA11_PIXEL225_POSITION         0x00000018
#define _GLCDCURDATA11_PIXEL225_MASK             0x0F000000
#define _GLCDCURDATA11_PIXEL225_LENGTH           0x00000004

#define _GLCDCURDATA11_PIXEL224_POSITION         0x0000001C
#define _GLCDCURDATA11_PIXEL224_MASK             0xF0000000
#define _GLCDCURDATA11_PIXEL224_LENGTH           0x00000004

#define _GLCDCURDATA12_PIXEL37_POSITION          0x00000000
#define _GLCDCURDATA12_PIXEL37_MASK              0x0000000F
#define _GLCDCURDATA12_PIXEL37_LENGTH            0x00000004

#define _GLCDCURDATA12_PIXEL36_POSITION          0x00000004
#define _GLCDCURDATA12_PIXEL36_MASK              0x000000F0
#define _GLCDCURDATA12_PIXEL36_LENGTH            0x00000004

#define _GLCDCURDATA12_PIXEL35_POSITION          0x00000008
#define _GLCDCURDATA12_PIXEL35_MASK              0x00000F00
#define _GLCDCURDATA12_PIXEL35_LENGTH            0x00000004

#define _GLCDCURDATA12_PIXEL34_POSITION          0x0000000C
#define _GLCDCURDATA12_PIXEL34_MASK              0x0000F000
#define _GLCDCURDATA12_PIXEL34_LENGTH            0x00000004

#define _GLCDCURDATA12_PIXEL33_POSITION          0x00000010
#define _GLCDCURDATA12_PIXEL33_MASK              0x000F0000
#define _GLCDCURDATA12_PIXEL33_LENGTH            0x00000004

#define _GLCDCURDATA12_PIXEL32_POSITION          0x00000014
#define _GLCDCURDATA12_PIXEL32_MASK              0x00F00000
#define _GLCDCURDATA12_PIXEL32_LENGTH            0x00000004

#define _GLCDCURDATA12_PIXEL31_POSITION          0x00000018
#define _GLCDCURDATA12_PIXEL31_MASK              0x0F000000
#define _GLCDCURDATA12_PIXEL31_LENGTH            0x00000004

#define _GLCDCURDATA12_PIXEL30_POSITION          0x0000001C
#define _GLCDCURDATA12_PIXEL30_MASK              0xF0000000
#define _GLCDCURDATA12_PIXEL30_LENGTH            0x00000004

